;E卡文本为双字节编码，
;每条文本包含3行句子，
;每行句子最多可输入24个8x16字，即48个字节，共192像素宽。
;中文12x12字体，最多显示16个汉字，即32字节，剩余16字节（8个字符空间）默认填充0x0000。
;程序已修改为可同时显示8x16原字符和12x12汉字字符，
;设定每行句子字符总长度达到192像素上限时，即不再继续读取文本。

;此处每条文本长度，与LengthOfEcard绑定，用于显示闪烁的“↓”位置
;若此处文本有修改变更长度，则必须同步修改LengthOfEcard。
;为避免“↓”显示错位，请确保“↓”前文本长度均为8的整数倍，
;原字符为8宽，汉字字符每2字占24宽（3*8），即“↓”所在行句子内的汉字字符数，需为偶数倍。

.loadtable "./charmap_8x16.txt"
.org TextOfEcardChinese
;[0]准备连接
    .strn "这里是与E卡读卡器               "
    .strn "进行通讯的房间。                "
    .strn "请在准备好后按A键确认。↓           "

;[1]E卡A002（客串）通讯成功
    .strn "通讯成功！↓                  "
    .strn "                        "
    .strn "                        "

;[2]E卡A002（客串）介绍
    .strn "将在捕获模式中激活               "
    .strn "特别客串的宝可梦。↓              "
    .strn "                        "

;[3]E卡A005（稀有）通讯成功
    .strn "通讯成功！↓                  "
    .strn "                        "
    .strn "                        "

;[4]E卡A005（稀有）介绍
    .strn "在捕获模式将更容易遇见             "
    .strn "稀有的宝可梦。↓                "
    .strn "                        "

;[5]E卡A004（豪华）通讯成功
    .strn "通讯成功！↓                  "
    .strn "                        "
    .strn "                        "

;[6]E卡A004（豪华）介绍1
    .strn "开启豪华模式。↓                "
    .strn "                        "
    .strn "                        "

;[7]E卡A004（豪华）介绍2
    .strn "•将以9球的数量开局。             "
    .strn "•将以大师球的等级开局。↓           "
    .strn "                        "

;[8]E卡A004（豪华）介绍3
    .strn "•将以99金币的数量开局。           "
    .strn "•将以皮丘救球辅助开局。↓           "
    .strn "                        "

;[9]E卡A003（遗迹）通讯成功
    .strn "通讯成功！↓                  "
    .strn "                        "
    .strn "                        "

;[10]E卡A003（遗迹）介绍
    .strn "•将在遗迹场景开局。              "
    .strn "•第一个奖励关卡将为              "
    .strn " 烈空坐的关卡。↓               "

;[11]E卡A001（奖励）通讯成功
    .strn "通讯成功！↓                  "
    .strn "                        "
    .strn "                        "

;[12]E卡A001（奖励）介绍
    .strn "可选择并游玩奖励关卡。↓            "
    .strn "                        "
    .strn "                        "

;[13]通讯失败1
    .strn "通讯失败。↓                  "
    .strn "                        "
    .strn "                        "

;[14]通讯失败2
    .strn "请检查连接并                  "
    .strn "重新尝试通讯。↓                "
    .strn "                        "



/*
.loadtable "./charmap_8x16.txt"
.org TextOfEcard
;[0]准备连接
    .strn "ここは カ-ドeと つうしんを するための へや"
    .strn "です。 じゅんびが できたら Aボタンを おして"
    .strn "ください。↓                  "

;[1]E卡A002（客串）通讯成功
    .strn "つうしんに せいこうしました！↓        "
    .strn "                        "
    .strn "                        "

;[2]E卡A002（客串）介绍
    .strn "GETモ-ドを はつどう させると とくべつ  "
    .strn "しゅつえんしている ポケモンが とうじょう   "
    .strn "します。↓                   "

;[3]E卡A005（稀有）通讯成功
    .strn "つうしんに せいこうしました！↓        "
    .strn "                        "
    .strn "                        "

;[4]E卡A005（稀有）介绍
    .strn "GETモ-ドで しゅつげんしづらい ポケモンが "
    .strn "でやすく なりました！↓            "
    .strn "                        "

;[5]E卡A004（豪华）通讯成功
    .strn "つうしんに せいこうしました！↓        "
    .strn "                        "
    .strn "                        "

;[6]E卡A004（豪华）介绍1
    .strn "デラックスモ-ドに なりました！↓       "
    .strn "                        "
    .strn "                        "

;[7]E卡A004（豪华）介绍2
    .strn "•ボ-ルが 9こから はじまります。      "
    .strn "•マスタ-ボ-ルから はじまります。↓     "
    .strn "                        "

;[8]E卡A004（豪华）介绍3
    .strn "•コインが 99こから はじまります。     "
    .strn "•つねに ピチュ-セイバ-が はつどうして   "
    .strn " います。↓                  "

;[9]E卡A003（遗迹）通讯成功
    .strn "つうしんに せいこうしました！↓        "
    .strn "                        "
    .strn "                        "

;[10]E卡A003（遗迹）介绍
    .strn "•いせきエリアから はじまります。       "
    .strn "•さいしょの ボ-ナスステ-ジが        "
    .strn " レックウザステ-ジに なります。↓      "

;[11]E卡A001（奖励）通讯成功
    .strn "つうしんに せいこうしました！↓        "
    .strn "                        "
    .strn "                        "

;[12]E卡A001（奖励）介绍
    .strn "ボ-ナスステ-ジを せんたくして あそべます。↓"
    .strn "                        "
    .strn "                        "

;[13]通讯失败1
    .strn "つうしんに しっぱいしました。↓        "
    .strn "                        "
    .strn "                        "

;[14]通讯失败2
    .strn "もういちど せつぞくを かくにんしてから    "
    .strn "つうしんを やりなおしてください。↓      "
    .strn "                        "
*/